{"modelTopology":{"class_name":"Model","config":{"name":"MixedRunnerRace","layers":[{"name":"history_input","class_name":"InputLayer","config":{"batch_input_shape":[null,18,8,25],"dtype":"float32","sparse":false,"name":"history_input"},"inbound_nodes":[]},{"name":"hist_masking","class_name":"TimeDistributed","config":{"layer":{"class_name":"Masking","config":{"mask_value":-1,"name":"masking_Masking1","trainable":true}},"name":"hist_masking","trainable":true},"inbound_nodes":[[["history_input",0,0,{}]]]},{"name":"hist_preenc_dense","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":16,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true}},"name":"hist_preenc_dense","trainable":true},"inbound_nodes":[[["hist_masking",0,0,{}]]]},{"name":"hist_preenc_ln","class_name":"TimeDistributed","config":{"layer":{"class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization1","trainable":true}},"name":"hist_preenc_ln","trainable":true},"inbound_nodes":[[["hist_preenc_dense",0,0,{}]]]},{"name":"static_input","class_name":"InputLayer","config":{"batch_input_shape":[null,18,28],"dtype":"float32","sparse":false,"name":"static_input"},"inbound_nodes":[]},{"name":"hist_lstm1","class_name":"TimeDistributed","config":{"layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0.2,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"hist_lstm1","trainable":true},"inbound_nodes":[[["hist_preenc_ln",0,0,{}]]]},{"name":"static_dense1","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":48,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true}},"name":"static_dense1","trainable":true},"inbound_nodes":[[["static_input",0,0,{}]]]},{"name":"hist_lstm2","class_name":"TimeDistributed","config":{"layer":{"class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":48,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0.2,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false}},"name":"hist_lstm2","trainable":true},"inbound_nodes":[[["hist_lstm1",0,0,{}]]]},{"name":"static_ln","class_name":"TimeDistributed","config":{"layer":{"class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization2","trainable":true}},"name":"static_ln","trainable":true},"inbound_nodes":[[["static_dense1",0,0,{}]]]},{"name":"runner_proj","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true}},"name":"runner_proj","trainable":true},"inbound_nodes":[[["hist_lstm2",0,0,{}]]]},{"name":"static_dense2","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true}},"name":"static_dense2","trainable":true},"inbound_nodes":[[["static_ln",0,0,{}]]]},{"name":"runner_proj_dropout","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dropout","config":{"rate":0.1,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true}},"name":"runner_proj_dropout","trainable":true},"inbound_nodes":[[["runner_proj",0,0,{}]]]},{"name":"static_dropout","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true}},"name":"static_dropout","trainable":true},"inbound_nodes":[[["static_dense2",0,0,{}]]]},{"name":"combine","class_name":"Concatenate","config":{"axis":-1,"name":"combine","trainable":true},"inbound_nodes":[[["runner_proj_dropout",0,0,{}],["static_dropout",0,0,{}]]]},{"name":"combined_dense","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":108,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true}},"name":"combined_dense","trainable":true},"inbound_nodes":[[["combine",0,0,{}]]]},{"name":"combined_ln","class_name":"TimeDistributed","config":{"layer":{"class_name":"LayerNormalization","config":{"axis":[1],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"layer_normalization_LayerNormalization3","trainable":true}},"name":"combined_ln","trainable":true},"inbound_nodes":[[["combined_dense",0,0,{}]]]},{"name":"pre_attention_ln","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"pre_attention_ln","trainable":true},"inbound_nodes":[[["combined_ln",0,0,{}]]]},{"name":"multi_head_attention_MultiHeadAttention1","class_name":"MultiHeadAttention","config":{"name":"multi_head_attention_MultiHeadAttention1","trainable":true,"num_heads":12,"embed_dim":108,"use_bias":true,"dropout":0.1,"causal":false},"inbound_nodes":[[["pre_attention_ln",0,0,{}]]]},{"name":"attention_fuse_concat","class_name":"Concatenate","config":{"axis":-1,"name":"attention_fuse_concat","trainable":true},"inbound_nodes":[[["combined_ln",0,0,{}],["multi_head_attention_MultiHeadAttention1",0,0,{}]]]},{"name":"attention_fuse_proj","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":108,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense6","trainable":true}},"name":"attention_fuse_proj","trainable":true},"inbound_nodes":[[["attention_fuse_concat",0,0,{}]]]},{"name":"attention_ln","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"attention_ln","trainable":true},"inbound_nodes":[[["attention_fuse_proj",0,0,{}]]]},{"name":"ffn_dense1","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":230,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense7","trainable":true}},"name":"ffn_dense1","trainable":true},"inbound_nodes":[[["attention_ln",0,0,{}]]]},{"name":"ffn_dropout","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dropout","config":{"rate":0.2,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true}},"name":"ffn_dropout","trainable":true},"inbound_nodes":[[["ffn_dense1",0,0,{}]]]},{"name":"ffn_dense2","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":108,"activation":"linear","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense8","trainable":true}},"name":"ffn_dense2","trainable":true},"inbound_nodes":[[["ffn_dropout",0,0,{}]]]},{"name":"ffn_residual_add","class_name":"Add","config":{"name":"ffn_residual_add","trainable":true},"inbound_nodes":[[["attention_ln",0,0,{}],["ffn_dense2",0,0,{}]]]},{"name":"post_ffn_ln","class_name":"LayerNormalization","config":{"axis":[2],"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"name":"post_ffn_ln","trainable":true},"inbound_nodes":[[["ffn_residual_add",0,0,{}]]]},{"name":"out_dropout","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dropout","config":{"rate":0.3,"noise_shape":null,"seed":null,"name":"dropout_Dropout4","trainable":true}},"name":"out_dropout","trainable":true},"inbound_nodes":[[["post_ffn_ln",0,0,{}]]]},{"name":"out_dense","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":24,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0001}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense9","trainable":true}},"name":"out_dense","trainable":true},"inbound_nodes":[[["out_dropout",0,0,{}]]]},{"name":"output","class_name":"TimeDistributed","config":{"layer":{"class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense10","trainable":true}},"name":"output","trainable":true},"inbound_nodes":[[["out_dense",0,0,{}]]]},{"name":"mask_input","class_name":"InputLayer","config":{"batch_input_shape":[null,18,1],"dtype":"float32","sparse":false,"name":"mask_input"},"inbound_nodes":[]},{"name":"mask_apply","class_name":"Multiply","config":{"name":"mask_apply","trainable":true},"inbound_nodes":[[["output",0,0,{}],["mask_input",0,0,{}]]]}],"input_layers":[["history_input",0,0],["static_input",0,0],["mask_input",0,0]],"output_layers":[["mask_apply",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightSpecs":[{"name":"hist_preenc_dense/kernel","shape":[25,16],"dtype":"float32"},{"name":"hist_preenc_dense/bias","shape":[16],"dtype":"float32"},{"name":"hist_preenc_ln/gamma","shape":[16],"dtype":"float32"},{"name":"hist_preenc_ln/beta","shape":[16],"dtype":"float32"},{"name":"hist_lstm1/kernel","shape":[16,256],"dtype":"float32"},{"name":"hist_lstm1/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"hist_lstm1/bias","shape":[256],"dtype":"float32"},{"name":"static_dense1/kernel","shape":[28,48],"dtype":"float32"},{"name":"static_dense1/bias","shape":[48],"dtype":"float32"},{"name":"hist_lstm2/kernel","shape":[64,192],"dtype":"float32"},{"name":"hist_lstm2/recurrent_kernel","shape":[48,192],"dtype":"float32"},{"name":"hist_lstm2/bias","shape":[192],"dtype":"float32"},{"name":"static_ln/gamma","shape":[48],"dtype":"float32"},{"name":"static_ln/beta","shape":[48],"dtype":"float32"},{"name":"runner_proj/kernel","shape":[48,64],"dtype":"float32"},{"name":"runner_proj/bias","shape":[64],"dtype":"float32"},{"name":"static_dense2/kernel","shape":[48,32],"dtype":"float32"},{"name":"static_dense2/bias","shape":[32],"dtype":"float32"},{"name":"combined_dense/kernel","shape":[96,108],"dtype":"float32"},{"name":"combined_dense/bias","shape":[108],"dtype":"float32"},{"name":"combined_ln/gamma","shape":[108],"dtype":"float32"},{"name":"combined_ln/beta","shape":[108],"dtype":"float32"},{"name":"pre_attention_ln/gamma","shape":[108],"dtype":"float32"},{"name":"pre_attention_ln/beta","shape":[108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/q_kernel","shape":[108,108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/k_kernel","shape":[108,108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/v_kernel","shape":[108,108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/o_kernel","shape":[108,108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/q_bias","shape":[108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/k_bias","shape":[108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/v_bias","shape":[108],"dtype":"float32"},{"name":"multi_head_attention_MultiHeadAttention1/o_bias","shape":[108],"dtype":"float32"},{"name":"attention_fuse_proj/kernel","shape":[216,108],"dtype":"float32"},{"name":"attention_fuse_proj/bias","shape":[108],"dtype":"float32"},{"name":"attention_ln/gamma","shape":[108],"dtype":"float32"},{"name":"attention_ln/beta","shape":[108],"dtype":"float32"},{"name":"ffn_dense1/kernel","shape":[108,230],"dtype":"float32"},{"name":"ffn_dense1/bias","shape":[230],"dtype":"float32"},{"name":"ffn_dense2/kernel","shape":[230,108],"dtype":"float32"},{"name":"ffn_dense2/bias","shape":[108],"dtype":"float32"},{"name":"post_ffn_ln/gamma","shape":[108],"dtype":"float32"},{"name":"post_ffn_ln/beta","shape":[108],"dtype":"float32"},{"name":"out_dense/kernel","shape":[108,24],"dtype":"float32"},{"name":"out_dense/bias","shape":[24],"dtype":"float32"},{"name":"output/kernel","shape":[24,1],"dtype":"float32"},{"name":"output/bias","shape":[1],"dtype":"float32"}],