{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"history_input","class_name":"InputLayer","config":{"batch_input_shape":[null,8,25],"dtype":"float32","sparse":false,"name":"history_input"},"inbound_nodes":[]},{"name":"masking_Masking1","class_name":"Masking","config":{"mask_value":-1,"name":"masking_Masking1","trainable":true},"inbound_nodes":[[["history_input",0,0,{}]]]},{"name":"static_input","class_name":"InputLayer","config":{"batch_input_shape":[null,27],"dtype":"float32","sparse":false,"name":"static_input"},"inbound_nodes":[]},{"name":"lstm_LSTM1","class_name":"LSTM","config":{"name":"lstm_LSTM1","trainable":true,"units":64,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0.1,"implementation":null,"return_sequences":true,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["masking_Masking1",0,0,{}]]]},{"name":"dense_Dense1","class_name":"Dense","config":{"units":48,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense1","trainable":true},"inbound_nodes":[[["static_input",0,0,{}]]]},{"name":"lstm_LSTM2","class_name":"LSTM","config":{"name":"lstm_LSTM2","trainable":true,"units":32,"activation":"tanh","recurrent_activation":"hard_sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"recurrent_initializer":{"class_name":"Orthogonal","config":{"gain":1,"seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"unit_forget_bias":null,"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"recurrent_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"recurrent_constraint":null,"bias_constraint":null,"dropout":0,"recurrent_dropout":0.1,"implementation":null,"return_sequences":false,"return_state":false,"go_backwards":false,"stateful":false,"unroll":false},"inbound_nodes":[[["lstm_LSTM1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization2","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization2","trainable":true},"inbound_nodes":[[["dense_Dense1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization1","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization1","trainable":true},"inbound_nodes":[[["lstm_LSTM2",0,0,{}]]]},{"name":"dense_Dense2","class_name":"Dense","config":{"units":32,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense2","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization2",0,0,{}]]]},{"name":"dropout_Dropout1","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"dropout_Dropout1","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization1",0,0,{}]]]},{"name":"dropout_Dropout2","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"dropout_Dropout2","trainable":true},"inbound_nodes":[[["dense_Dense2",0,0,{}]]]},{"name":"concatenate_Concatenate1","class_name":"Concatenate","config":{"axis":-1,"name":"concatenate_Concatenate1","trainable":true},"inbound_nodes":[[["dropout_Dropout1",0,0,{}],["dropout_Dropout2",0,0,{}]]]},{"name":"dense_Dense3","class_name":"Dense","config":{"units":48,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":{"class_name":"L1L2","config":{"l1":0,"l2":0.0002}},"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense3","trainable":true},"inbound_nodes":[[["concatenate_Concatenate1",0,0,{}]]]},{"name":"batch_normalization_BatchNormalization3","class_name":"BatchNormalization","config":{"axis":-1,"momentum":0.99,"epsilon":0.001,"center":true,"scale":true,"beta_initializer":{"class_name":"Zeros","config":{}},"gamma_initializer":{"class_name":"Ones","config":{}},"moving_mean_initializer":{"class_name":"Zeros","config":{}},"moving_variance_initializer":{"class_name":"Ones","config":{}},"beta_regularizer":null,"gamma_regularizer":null,"beta_constraint":null,"gamma_constraint":null,"name":"batch_normalization_BatchNormalization3","trainable":true},"inbound_nodes":[[["dense_Dense3",0,0,{}]]]},{"name":"dropout_Dropout3","class_name":"Dropout","config":{"rate":0.25,"noise_shape":null,"seed":null,"name":"dropout_Dropout3","trainable":true},"inbound_nodes":[[["batch_normalization_BatchNormalization3",0,0,{}]]]},{"name":"dense_Dense4","class_name":"Dense","config":{"units":24,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense4","trainable":true},"inbound_nodes":[[["dropout_Dropout3",0,0,{}]]]},{"name":"dense_Dense5","class_name":"Dense","config":{"units":1,"activation":"sigmoid","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"dense_Dense5","trainable":true},"inbound_nodes":[[["dense_Dense4",0,0,{}]]]}],"input_layers":[["history_input",0,0],["static_input",0,0]],"output_layers":[["dense_Dense5",0,0]]},"keras_version":"tfjs-layers 4.22.0","backend":"tensor_flow.js"},"weightSpecs":[{"name":"lstm_LSTM1/kernel","shape":[25,256],"dtype":"float32"},{"name":"lstm_LSTM1/recurrent_kernel","shape":[64,256],"dtype":"float32"},{"name":"lstm_LSTM1/bias","shape":[256],"dtype":"float32"},{"name":"dense_Dense1/kernel","shape":[27,48],"dtype":"float32"},{"name":"dense_Dense1/bias","shape":[48],"dtype":"float32"},{"name":"lstm_LSTM2/kernel","shape":[64,128],"dtype":"float32"},{"name":"lstm_LSTM2/recurrent_kernel","shape":[32,128],"dtype":"float32"},{"name":"lstm_LSTM2/bias","shape":[128],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/gamma","shape":[48],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/beta","shape":[48],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/gamma","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/beta","shape":[32],"dtype":"float32"},{"name":"dense_Dense2/kernel","shape":[48,32],"dtype":"float32"},{"name":"dense_Dense2/bias","shape":[32],"dtype":"float32"},{"name":"dense_Dense3/kernel","shape":[64,48],"dtype":"float32"},{"name":"dense_Dense3/bias","shape":[48],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/gamma","shape":[48],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/beta","shape":[48],"dtype":"float32"},{"name":"dense_Dense4/kernel","shape":[48,24],"dtype":"float32"},{"name":"dense_Dense4/bias","shape":[24],"dtype":"float32"},{"name":"dense_Dense5/kernel","shape":[24,1],"dtype":"float32"},{"name":"dense_Dense5/bias","shape":[1],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_mean","shape":[48],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization2/moving_variance","shape":[48],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_mean","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization1/moving_variance","shape":[32],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_mean","shape":[48],"dtype":"float32"},{"name":"batch_normalization_BatchNormalization3/moving_variance","shape":[48],"dtype":"float32"}],